fixture/vcr_cassettes/api-wallet-charge-success.json

[
  {
    "request": {
      "body": "{\"scope\":\"wallet\",\"responseType\":\"token\",\"phone\":\"7777777777\",\"email\":\"bar@baz.com\",\"clientId\":\"CLIENT_ID\"}",
      "headers": [],
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://accounts-uat.paytm.com/signin/otp"
    },
    "response": {
      "body": "{\"status\":\"SUCCESS\",\"message\":\"Otp sent to phone\",\"responseCode\":\"01\",\"state\":\"c3ce99bb-6a82-4b46-9ee7-6cb149ec73f8\"}",
      "headers": {
        "Access-Control-Allow-Headers": "*",
        "Cache-control": "no-cache=\"set-cookie\"",
        "Content-Type": "application/json",
        "Date": "Thu, 02 Nov 2017 11:52:48 GMT",
        "Server": "nginx",
        "Set-Cookie": "***",
        "X-Frame-Options": "DENY",
        "Content-Length": "117",
        "Connection": "keep-alive"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "{\"state\":\"c3ce99bb-6a82-4b46-9ee7-6cb149ec73f8\",\"otp\":\"489871\"}",
      "headers": {
        "Authorization": "***"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://accounts-uat.paytm.com/signin/validate/otp"
    },
    "response": {
      "body": "{\"access_token\":\"810d0508-c1d9-4d0e-ada1-e6e009eda9ad\",\"expires\":\"1516618298430\",\"scope\":\"wallet\",\"resourceOwnerId\":\"11065108\"}",
      "headers": {
        "Access-Control-Allow-Headers": "*",
        "Cache-control": "no-cache=\"set-cookie\"",
        "Content-Type": "application/json",
        "Date": "Thu, 02 Nov 2017 11:52:52 GMT",
        "Server": "nginx",
        "Set-Cookie": "***",
        "X-Frame-Options": "DENY",
        "Content-Length": "127",
        "Connection": "keep-alive"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "",
      "headers": {
        "session_token": "810d0508-c1d9-4d0e-ada1-e6e009eda9ad"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://accounts-uat.paytm.com/user/details"
    },
    "response": {
      "body": "{\"id\":11065108,\"email\":\"shrikant@pacetravels.in\",\"mobile\":\"7777777777\",\"expires\":\"1516618298430\"}",
      "headers": {
        "Access-Control-Allow-Headers": "*",
        "Cache-control": "no-cache=\"set-cookie\"",
        "Content-Type": "application/json",
        "Date": "Thu, 02 Nov 2017 11:52:52 GMT",
        "Server": "nginx",
        "Set-Cookie": "***",
        "X-Frame-Options": "DENY",
        "Content-Length": "97",
        "Connection": "keep-alive"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "JsonData={\"TxnAmount\":\"1.00\",\"SSOToken\":\"SSO_TOKEN\",\"ReqType\":\"WITHDRAW\",\"PaymentMode\":\"PPI\",\"OrderId\":\"abc123\",\"MID\":\"MID\",\"IndustryType\":\"Retail\",\"DeviceId\":\"7777777777\",\"CustId\":\"abc123\",\"Currency\":\"INR\",\"CheckSum\":\"CHECKSUM\",\"Channel\":\"WEB\",\"AuthMode\":\"USRPWD\",\"AppIP\":\"127.0.0.1\"}",
      "headers": [],
      "method": "post",
      "options": {
        "recv_timeout": 30000
      },
      "request_body": "",
      "url": "https://pguat.paytm.com/oltp/HANDLER_FF/withdrawScw"
    },
    "response": {
      "body": "{\"TxnId\":70000353901,\"MID\":\"MID\",\"OrderId\":\"abc123\",\"TxnAmount\":\"1.00\",\"BankTxnId\":\"950127\",\"ResponseCode\":\"01\",\"ResponseMessage\":\"Txn Successful.\",\"Status\":\"TXN_SUCCESS\",\"PaymentMode\":\"PPI\",\"BankName\":\"WALLET\",\"CheckSum\":\"CHECKSUM\",\"CustId\":\"abc123\",\"MBID\":\"MBID\"}",
      "headers": {
        "Server": "nginx/1.6.2",
        "Content-Type": "application/json",
        "Content-Length": "418",
        "Date": "Thu, 02 Nov 2017 11:52:53 GMT",
        "Connection": "keep-alive",
        "Set-Cookie": "***"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]